app/controllers/students_controller.rb

INSERT INTO "students" ("name", "number", "subject_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "d"], ["number", "d"], ["subject_id", "d"], ["created_at", "2019-10-03 15:03:09.008816"], ["updated_at", "2019-10-03 15:03:09.008816"]]
---
  def create
    @student = Student.new(student_params)
    if @student.save

DELETE FROM "students" WHERE "students"."id" = ?  [["id", 5]]
---
  def destroy
    @student = find_student_by_id
    @student.destroy

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def find_student_by_id
    Student.find(params[:id])