app/controllers/subjects_controller.rb

  def create
    @subject = Subject.new(subject_params)
    if @subject.save
---
INSERT INTO "subjects" ("department", "content", "teacher", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["department", "明るくて"], ["content", "あ"], ["teacher", "A"], ["created_at", "2019-10-03 09:34:43.062656"], ["updated_at", "2019-10-03 09:34:43.062656"]]

  def update
    @subject = find_subject_by_id
    if @subject.update(subject_params)
---
UPDATE "subjects" SET "department" = ?, "updated_at" = ? WHERE "subjects"."id" = ?  [["department", "IT学"], ["updated_at", "2019-10-03 09:34:18.672558"], ["id", 4]]

  def destroy
    @subject = find_subject_by_id
    @subject.destroy
---
DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 12]]

  def find_subject_by_id
    Subject.find(params[:id])
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]